app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id]
      if valid_for_editing?
        (@song = Song.find(params[:id]))